In [4]:
import pandas as pd

In [5]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

#### Question 1-

In [6]:
l=[4, 8, 15, 16, 23, 42]

In [7]:
pd.Series(l)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

#### Question 2-

In [8]:
v=[1,'pwskills',True,2,3,{1,2,3,4},[4,5,6],'hello',34.56,{"key":"value"}]

In [9]:
pd.Series(v)

0                   1
1            pwskills
2                True
3                   2
4                   3
5        {1, 2, 3, 4}
6           [4, 5, 6]
7               hello
8               34.56
9    {'key': 'value'}
dtype: object

#### Question 3-

In [10]:
data={'Name':['Alice','Bob','Claire'],'Age':[25,30,27],'Gender':['Female','Male','Female']}

In [11]:
df=pd.DataFrame(data,index=None)

In [12]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

#### Question 4-

DataFrame-A dataframe in pandas is a 2-dimensional data structure consisting of rows and columns which may be of different types.
Unlike in an array, we can store only similar kind of data either int,float,string etc but by using dataframe we can store different kinds of data.

Pandas Series is a 1-Dimensional data structure, which can only store same type of data. It's size is immutable i.e once created, the size of Series object cannot be changed.

However, Pandas DataFrame is a 2-dimensional data structure which can store data of different data types. It is also size mutable i.e elements can be dropped or added in an existing DataFrame.

#### Question 5-

The Pandas apply() function can be used to apply a function on every value in a column or row of a DataFrame, and transform that column or row to the resulting values.Ex-

In [13]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [14]:
def double(x):
    return 2*x
df.Age=df.Age.apply(double)

In [15]:
df.Age

0    50
1    60
2    54
Name: Age, dtype: int64

In [16]:
df.Age=df.Age.apply(lambda x:3*x)

In [17]:
df.Age

0    150
1    180
2    162
Name: Age, dtype: int64

We can also add similar type of data to a column in a dataframe using :

In [18]:
df['newcolumn']=df['Age']+50

In [19]:
df

     Name  Age  Gender  newcolumn
0   Alice  150  Female        200
1     Bob  180    Male        230
2  Claire  162  Female        212

#### Question 6-

DataFrame and Panel are mutable, Series is immutable .

#### Question 7-

In [20]:
l1=[1,2,3,4]
l2=[5,6,7,8]
l3=[9,10,11,12]

In [21]:
a=pd.Series(l1)
b=pd.Series(l2)
c=pd.Series(l3)

In [98]:
df1=pd.concat([a,b,c],axis=1)

In [99]:
df1

   0  1   2
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

In [93]:
data1=['Sudhanshu',1,'Delhi']
data2=["Sahil",2,'Banglore']
data3=['Habibi',3,'Kolkata']

In [94]:
l1=pd.Series(data1,index=('Name','id','City'))
l2=pd.Series(data2,index=('Name','id','City'))
l3=pd.Series(data3,index=('Name','id','City'))

In [95]:
data=[l1,l2,l3]

In [96]:
df2=pd.concat(data,axis=1)

In [97]:
df2

              0         1        2
Name  Sudhanshu     Sahil   Habibi
id            1         2        3
City      Delhi  Banglore  Kolkata

In order to merge multiple series together into a DataFrame , we can use concat().Ex-

In [73]:
courses=pd.Series(['DSM','Web Dev','C++'])
fees=pd.Series([3500,3200,3000])
discount=pd.Series([500,200,0])

In [77]:
df=pd.concat([courses,fees,discount],axis=1)
print(df)

         0     1    2
0      DSM  3500  500
1  Web Dev  3200  200
2      C++  3000    0